Autodesk.Revit.DB.FilledRegion.IsValidFilledRegionTypeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates whether the given Id is a valid filled region type Id.
document:
The document.
typeId:
The filled region type Id.
Returns:
True if it is a valid filled region type Id, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.FilledRegion.IsValidLineStyleIdForFilledRegion(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates whether the given Id is a valid line style Id.
document:
The document.
lineStyleId:
The line style Id.
Returns:
True if it is a valid line style Id, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.FilledRegion.GetValidLineStyleIdsForFilledRegion(Autodesk.Revit.DB.Document)
Gets the line style Ids which are permitted to be assigned to a filled region.
document:
The document.
Returns:
The valid line style Ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.FilledRegion.SetLineStyleId(Autodesk.Revit.DB.ElementId)
Sets the line style Id for all boundaries.
lineStyleId:
The line style Id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
lineStyleId is not a valid line style Id for a filled region.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.FilledRegion.GetBoundaries
Gets the boundaries.
Returns:
The filled region boundaries.
Since:
2013

Autodesk.Revit.DB.FilledRegion.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a filled region from the given boundaries.
Remarks:
The line style of the boundaries will be set to thin lines by default.
document:
The document in which to create the filled region.
typeId:
The filled region type Id.
viewId:
The view Id.
boundaries:
The boundaries.
Returns:
The newly created filled region.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Id typeId is invalid.
-or-
Thrown if the viewId or typeId is invalid, or the view does not support
the detail items creation, or if the boundaries are empty, open, or self-intersecting.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.FilledRegion.IsMasking
Indicates whether this element is a 'Filled Region or a 'Masking Region'.
Since:
2012

Autodesk.Revit.DB.FilledRegion
A filled region element.
Since:
2012